OFtutorialTest04_MRF/simpleFoam/turbine_komega/0/Urel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Urel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50904
(
(-1.20401 4.67339 -10)
(-1.17758 4.58655 -10)
(-1.10419 4.66073 -10)
(-1.08249 4.58198 -10)
(-1.20669 4.67342 -10)
(-1.18017 4.58642 -10)
(-1.10641 4.66079 -10)
(-1.08465 4.58191 -10)
...
)
;

boundaryField
{
    HUB
    {
        type            noSlip;
    }
    SHROUD
    {
        type            noSlip;
    }
    INFLOW
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    OUTFLOW
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BLADE
    {
        type            noSlip;
    }
    PER1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    PER2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
