OFtutorialTest04_MRF/simpleFoam/turbine_komega/0/motorBike_komega/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    
    INFLOW
    {
        // type            fixedValue;
        // value           uniform (-10 0 0);
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    OUTFLOW
    {
        // type            inletOutlet;
        // inletValue      uniform (0 0 0);
        // value           uniform (0 0 0);
		// type            zeroGradient;
		type            fixedValue;
		value           $internalField;
		
    }
    
    BLADE
    {
        type            noSlip;
    }

    HUB
    {
        type            noSlip;
    }
    
    SHROUD
    {
        type            noSlip;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
