OFtutorialTest04_MRF/simpleFoam/turbine_komega/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{

    
    INFLOW
    {
        // type            zeroGradient;
		type            fixedValue;
        value           $internalField;
    }

    OUTFLOW
    {
        // type            fixedValue;
        // value           uniform 0;
		type            zeroGradient;
    }

    BLADE
    {
        type            zeroGradient;
    }

    HUB
    {
        type            zeroGradient;
    }
    
    SHROUD
    {
        type            zeroGradient;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
    
    
}


// ************************************************************************* //
